/********************************************************************
**版权所有：         深圳市几米物联有限公司
**文件名称：        main.h
**文件描述：        GD32F505VGT7 FreeRTOS基础项目主头文件
**当前版本：        V1.0
**作    者：        伍玉蛟 (wuyujiao@jimiiot.com)
**完成日期：        2026.04.16
*********************************************************************
** 功能描述：       1. 声明主函数及系统初始化任务
**                 2. 定义项目相关宏和函数接口
*********************************************************************/

#ifndef __MAIN_H__
#define __MAIN_H__

/* 系统初始化任务函数声明 */
void init_task(void *pvParameters);

#endif
